package com.java.basic.c02_object;

/**
 * 类的成员：
 * 1）属性（必用）
 * 2）构造器（必用）
 * 3）方法（必用）
 * 4）代码块（比较少）
 * 3）内部类（比较少）
 *
 * 修饰符：
 * static (重要)
 * final (重要)
 * abstract (重要)
 * interface (重要)
 * native (了解)
 *
 *
 * 1、内部类：
 *      当一个类的内部，仍然有一个完整的结构，这个完整的结构仍然需要一个类进行描述，因为有自己的特征（属性，方法），并且这个内部类是为外部类服务
 *
 * 内部类：集合
 *
 * 身体 （Body） 里面有各种器官，例如：心脏，也是一个独立的结构，也需要用一个描述。而且这个心脏是为Body服务，离开Body没有意义。
 *
 * 2、分类
 * 根据位置：
 *  一、成员内部类
 *      和成员变量一样，在类中，方法外
 *      1、静态成员内部类：简称静态内部类
 *      2、非静态成员内部类：简称成员内部类
 *  二、局部内部类
 *      在方法内
 *      1、有名字的局部内部类：简称局部内部类（很少）
 *      2、没名字的局部内部类：简称匿名内部类
 *
 */
public class TestInner {

}





















